lv_cfd/openfoam_case/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
    
    allBoundary
    {
        type            fixedValue;
        value           uniform 0;
    }
}
