lv_cfd/openfoam_case/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Blood: Newtonian approximation
transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 3.3e-06;   // kinematic viscosity (m²/s)
