lv_cfd/openfoam_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (0.082058 0.090585 0.026191)
    (0.188791 0.090585 0.026191)
    (0.188791 0.222265 0.026191)
    (0.082058 0.222265 0.026191)
    (0.082058 0.090585 0.140119)
    (0.188791 0.090585 0.140119)
    (0.188791 0.222265 0.140119)
    (0.082058 0.222265 0.140119)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 25 25) simpleGrading (1 1 1)
);

edges ();

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 1 5 4)
            (2 3 7 6)
            (0 4 7 3)
            (1 2 6 5)
        );
    }
);
