lv_cfd/openfoam_case/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.01;
    }

    "(U|k|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    2;      // Outer PIMPLE iterations
    nCorrectors         2;      // Pressure corrections
    nNonOrthogonalCorrectors 1;
    
    residualControl
    {
        U
        {
            tolerance   1e-5;
            relTol      0;
        }
        p
        {
            tolerance   1e-4;
            relTol      0;
        }
    }
}
